vmux0.0.9/socialNetwork_bridge-e1000_27vms_128rps_rep3.log
Running 1m test @ http://10.1.0.44:8080
  8 threads and 16 connections

  Thread calibration: mean lat.: 2.252ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.654ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.682ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.321ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.689ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.536ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.459ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.769ms, rate sampling interval: 12ms

-----------------------------------------------------------------------
Test Results @ http://10.1.0.44:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.61ms    1.85ms   9.49ms   90.10%
    Req/Sec    16.68     40.88   181.00     84.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.98ms
 75.000%    2.64ms
 90.000%    4.38ms
 99.000%    9.49ms
 99.900%   11.36ms
 99.990%   16.40ms
 99.999%   19.01ms
100.000%   19.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.899     0.000000            1         1.00
       1.481     0.100000          648         1.11
       1.612     0.200000         1294         1.25
       1.717     0.300000         1941         1.43
       1.825     0.400000         2590         1.67
       1.975     0.500000         3237         2.00
       2.069     0.550000         3560         2.22
       2.187     0.600000         3882         2.50
       2.329     0.650000         4203         2.86
       2.473     0.700000         4531         3.33
       2.639     0.750000         4856         4.00
       2.711     0.775000         5015         4.44
       2.819     0.800000         5175         5.00
       2.929     0.825000         5336         5.71
       3.073     0.850000         5499         6.67
       3.257     0.875000         5659         8.00
       3.515     0.887500         5739         8.89
       4.395     0.900000         5820        10.00
       5.735     0.912500         5901        11.43
       6.471     0.925000         5984        13.33
       6.979     0.937500         6062        16.00
       7.483     0.943750         6104        17.78
       7.903     0.950000         6143        20.00
       8.207     0.956250         6184        22.86
       8.447     0.962500         6225        26.67
       8.639     0.968750         6264        32.00
       8.823     0.971875         6285        35.56
       8.903     0.975000         6305        40.00
       9.007     0.978125         6325        45.71
       9.151     0.981250         6346        53.33
       9.239     0.984375         6366        64.00
       9.295     0.985938         6376        71.11
       9.383     0.987500         6386        80.00
       9.447     0.989062         6396        91.43
       9.519     0.990625         6406       106.67
       9.663     0.992188         6416       128.00
       9.727     0.992969         6421       142.22
       9.823     0.993750         6426       160.00
       9.879     0.994531         6431       182.86
      10.007     0.995313         6436       213.33
      10.215     0.996094         6441       256.00
      10.255     0.996484         6444       284.44
      10.367     0.996875         6446       320.00
      10.471     0.997266         6449       365.71
      10.583     0.997656         6451       426.67
      10.815     0.998047         6454       512.00
      11.095     0.998242         6455       568.89
      11.111     0.998437         6456       640.00
      11.215     0.998633         6458       731.43
      11.327     0.998828         6459       853.33
      11.359     0.999023         6460      1024.00
      11.687     0.999121         6461      1137.78
      11.687     0.999219         6461      1280.00
      11.991     0.999316         6462      1462.86
      12.103     0.999414         6463      1706.67
      12.103     0.999512         6463      2048.00
      13.551     0.999561         6464      2275.56
      13.551     0.999609         6464      2560.00
      13.551     0.999658         6464      2925.71
      16.399     0.999707         6465      3413.33
      16.399     0.999756         6465      4096.00
      16.399     0.999780         6465      4551.11
      16.399     0.999805         6465      5120.00
      16.399     0.999829         6465      5851.43
      19.007     0.999854         6466      6826.67
      19.007     1.000000         6466          inf
#[Mean    =        2.614, StdDeviation   =        1.853]
#[Max     =       18.992, Total count    =         6466]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  7779 requests in 1.02m, 1.52MB read
  Non-2xx or 3xx responses: 726
Requests/sec:    127.25  
Transfer/sec:     25.53KB
AUTOTEST_DONE